VPro/src/InformationRegisters/WorkTimeStandards/WorkTimeStandards.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>WorkTimeStandards</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Norm</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <dimensions>
    <name>ProductsAndServices</name>
    <type>
      <types>CatalogRef.ProductsAndServices</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsAndServicesCharacteristics</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/Enums/ProductsAndServicesTypes/ProductsAndServicesTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductsAndServicesTypes</name>
  <enumValues>
    <name>InventoryItem</name>
  </enumValues>
  <enumValues>
    <name>Service</name>
  </enumValues>
  <enumValues>
    <name>Work</name>
  </enumValues>
  <enumValues>
    <name>Operation</name>
  </enumValues>
  <enumValues>
    <name>WorkKind</name>
  </enumValues>
  <enumValues>
    <name>DeleteExpense</name>
  </enumValues>
</mdclass:Enum>

VPro/src/InformationRegisters/WorkTimeStandards/Forms/ListForm/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
// Procedure-handler of the OnCreateAtServer event.
// Performs initial attributes forms filling.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Filter") AND Parameters.Filter.Property("ProductsAndServices") Then

		ProductsAndServices = Parameters.Filter.ProductsAndServices;

		If ProductsAndServices.ProductsAndServicesType <> Enums.ProductsAndServicesTypes.Work Then
			
			AutoTitle = False;
			Title = NStr("en='Standard hours are stored only for works';ru='Нормы времени хранятся только для работ';vi='Định mức thời gian chỉ được lưu đối với công việc'");

			Items.List.ReadOnly = True;
			
		ElsIf ProductsAndServices.FixedCost Then
			
			AutoTitle = False;
			Title = NStr("en='""Work cost calculation method"" should be ""Standard time""';ru='""Способ расчета стоимости работ"" должен быть ""Норма времени""';vi='""Cách tính giá trị công việc"" cần phải là ""Định mức thời gian""'");

			Items.List.ReadOnly = True;
			
		EndIf;

	EndIf;
		
EndProcedure // OnCreateAtServer()
